package Qa14HomeWork_001;

// Main class
public class HomeWork001 {
    // Main method
    public static void main(String[] args) {
// Первое задание
        System.out.println("\nПервое задание");
        System.out.println("\"To be");
        System.out.println("\t   or not");
        System.out.println("\t\t\t to be...\"");
        System.out.println("\t\t\t\t /Shekespear/");
//Второе задание
        System.out.println("");
        System.out.println("\nВторое задание");
        System.out.println("I love Java!");
        System.out.println("\t\tI love Java!");
        System.out.println("\t\t\t\tI love Java!");
        System.out.println("\t\t\t\t\t\tI love Java!");
        System.out.println("\t\t\t\t\t\t\t\tI love Java!");
//Третье задание
        System.out.println("");
        System.out.println("\nТретье задание");
        System.out.println(" '\\t', '\\n', '\\\\', '\\'', '\\\"'- ");
//Четвертое задание
        System.out.println("");
        System.out.println("\nЧетвертое задание");
        System.out.println("Если можно что-то не делать, это будет не сделано.");
//Пятое задание
        System.out.println("");
        System.out.println("\nПятое задание");
        System.out.println("        Сентябрь 2019");
        System.out.println("пн  вт ср чт пт сб вс");
        System.out.println("26  27 28 29 30 31  1");
        System.out.println(" 2   3  4  5  6  7  8");
        System.out.println(" 9  10 11 12 13 14 15");
        System.out.println("16  17 18 19 20 21 22");
        System.out.println("23  24 25 26 27 28 29");
        System.out.println("30   1  2  3  4  5  6");
//Шестое задание
        System.out.println("");
        System.out.println("\nШестое задание");
        System.out.println("                               *    *");
        System.out.println("                               *    *");
        System.out.println("                     ****      *    *");
        System.out.println("                 ****     **** *    *");
        System.out.println("             ****             ****  *");
        System.out.println("         ****                     **** ");
        System.out.println("     ****                             **** ");
        System.out.println(" ********************************************* ");
        System.out.println("***  *                                   *  ***");
        System.out.println("     *                                   *     ");
        System.out.println("     *    *******         *******        *     ");
        System.out.println("     *    *  *  *         *     *        *     ");
        System.out.println("     *    *******         *     *        *         **  **  **  **  **  **  **  **  **");
        System.out.println("     *    *  *  *         *     *        *         **  **  **  **  **  **  **  **  **");
        System.out.println("     *    *******         *     *        *       **************************************");
        System.out.println("     *                    *     *        *         **  **  **  **  **  **  **  **  **");
        System.out.println("     *                    *     *        *         **  **  **  **  **  **  **  **  **");
        System.out.println("     *                    *     *        *       **************************************");
        System.out.println("     *************************************         **  **  **  **  **  **  **  **  **");
//Седьмое задание
        System.out.println("");
        System.out.println("\nСедьмое задание");
        System.out.println("                           Тогобицкий Денис Валентинович");
        System.out.println("                                         * ");
        System.out.println("                                         *");
        System.out.println("                                      *     *");
        System.out.println("                                    *          *");
        System.out.println("                                  *              *");
        System.out.println("                                *                  *");
        System.out.println("       Тогобицкий Валентин Григорьевич        Тогобицкая Валентина Павловна");
        System.out.println("                      *                                      * ");
        System.out.println("                      *                                      *");
        System.out.println("                   *     *                                *     *");
        System.out.println("                 *         *                            *         *");
        System.out.println("               *             *                        *             *");
        System.out.println("             *                 *                    *                  *");
        System.out.println("      Дедушка (со стороны отца) Бабушка      Дедушка (со стороны матери) Бабушка");
//Восьмое задание
        System.out.println("");
        System.out.println("\nВосьмое задание");
        System.out.println("     *      ********   *      *   *      *    * * * * ");
        System.out.println("    **      *          *      *   *    * *   *       *");
        System.out.println("   ****     ********   ********   *   *  *   *  ");
        System.out.println("  ******    *          *      *   * *    *   *       *");
        System.out.println(" ********   ********   *      *   *      *    * * * * ");
        System.out.println("*        *");
//Девятое задание
        System.out.println("");
        System.out.println("\nДевятое задание");
        System.out.println("                                                 Резюме\n" +
                "                                   тестировщик программного обеспечения\n" +
                "\n" +
                "23 сентября 2019г.                                                                                                      г. Одесса\n" +
                "\n" +
                "                                                       Общая информация\n" +
                "ФИО: Тогобицкий Денис Валентинович\n" +
                "Год рождения: 1981 (38 лет)\n" +
                "Место жительства: г. Одесса, Приморский район\n" +
                "Телефон: 067 483-01-59\n" +
                "e-mail: 61swan@gmail.com\n" +
                "\n" +
                "                                                          Образование:\n" +
                "\tПрофильное:\n" +
                "Компьютерная Академия ШАГ, годовой курс Тестирование программного обеспечения (QA) (в процессе обучения, 2019г.);\n" +
                "Сетевая академия Cisco:  курсы IT Essentials, Cybersecurity Essentials 1, NDG Linux Unhatched 0918, Introduction to IoT 0419, Pyton (в процессе изучения), 2019г.).\n" +
                "w3schools.com: курсы Learn Python (Python Tutorial) (2019г.).\n" +
                "Codecademy: курсы Learn HTML, Learn CSS, Learn How to Code, Learn Git (в процессе обучения) (2019г.).\n" +
                "Одесский дом ученых, курсы Дизайн полиграфической продукции (2001г.).\n" +
                "\tНепрофильное:\n" +
                "Одесский Национальный университет им. Мечникова, Экономико-правовой факультет, специальность «Правоведение» (2003г.);\n" +
                "Одесский дом ученых, Бухгалтерский учет, основы налогового учета, 1С: Бухгалтерия (2009г.);\n" +
                "Институт современного управления и бизнеса, Курсы таможенных брокеров (2011г.);\n" +
                "Одесский национальный экономический университет, курсы Управления активами, - получено квалификационное удостоверение и сертификат Национальной комиссии по ценным бумагам и фондовому рынку (2017г.).\n" +
                "\n" +
                "                                                        Практические навыки\n" +
                "Работа с документацией:\n" +
                "Участие в составлении, рецензировании и верификации технической и бизнес документации программного обеспечения на стороне заказчика: BRD. PRD, технические требования, спецификации, тест планы.\n" +
                "Составление и выполнение тестов, тест-кейсов (комплектов), чек-листов.\n" +
                "Составление баг-отчетов.\n" +
                "Работа с ПО:\n" +
                "Багтрекинговые системы: Jira. Bugzilla, Redmine, Mantis Bug Tracker.\n" +
                "Системы тест-менеджмента:TestRail.\n" +
                "Мобильного тестирования: Nox, BlueStacks, MЕmu.\n" +
                "Виртуализации: Oracle VM VirtualBox.\n" +
                "Web: OsCommerce (опыт развертывание интернет магазина), Jumla.\n" +
                "Операционные системы: Windows, Linux, Android.\n" +
                "Автоматизации тестирования: Test Complet, Unified Functional Testing (Micro Focus, HP), Selenium IDE.\n" +
                "Нагрузочного тестирования: Load Impact (web сервис).\n" +
                "Стек технологий (базовый уровень):\n" +
                "HTML, CSS, Pyton3.\n" +
                "\t Языки: \n" +
                "Украинский и Русский (родные), Английский (базовый, - чтение и понимание печатного текста), Немецкий (базовый).\n" +
                "\n" +
                "                                                         Опыт работы\n" +
                "\tПрофильный: Филиал ООО «Ориент Экспресс» в г. Одесса и ООО «Ориент Авто Экспресс» (грузовые контейнерные перевозки) с октября 2005г. по декабрь 2006г.: Служебные обязанности: сопровождение разработки, внедрения, пострелизного обслуживания и модификации системы (web приложения) управления автотранспортным предприятием, а так же надстройки (модуля) АТП (автотранспортное предприятие) для 1С (работа с документацией (см. выше), пострелизный сбор, систематизация, классификация возникающих ошибок, а так же пожеланий пользователей по улучшению ПО, их предварительный анализ, представление заинтересованным лицам в обобщенном виде для информации, работы, а руководству - для принятия управленческих решений).\n" +
                "Холдинг Алекс Групп (КОНА) (основное направление – гражданское строительство) с 16 мая 2016г. по 15 февраля 2019г. Служебные обязанности: частичное сопровождение внедрения, обслуживания и модификации системы (web приложения) управления  предприятием на базе Битрикс 24 (написание требований (PRD) для бизнес процесса документооборота (договора и сопровождающие их первичные документы) и его графика).\n" +
                "\n" +
                "\tНепрофильный: Юрист в различных компаниях (сентябрь 2002г. - февраль 2019г.)");
    }
}
